---
type: StairsLandingType
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 3
tags: [revit-api, class]
---

# StairsLandingType

`Autodesk.Revit.DB.Architecture.StairsLandingType` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | IsMonolithic | 2013 | `public bool IsMonolithic { get ; }` |
| Property | Parameter | — | `` |
| Property | Thickness | 2013 | `public double Thickness { get ; set ; }` |